{
    "KPlugin": {
        "Description": "Operator of trains in Montenegro. Covers Montenegro and parts of Serbia.",
        "Description[ca@valencia]": "Operador de trens en Montenegro. Cobrix Montenegro i parts de Serbia.",
        "Description[ca]": "Operador de trens a Montenegro. Cobreix Montenegro i parts de Serbia.",
        "Description[eo]": "Funkciigisto de trajnoj en Montenegro. Kovras Montenegron kaj partojn de Serbio.",
        "Description[es]": "Operador de trenes de Montenegro. Cubre Montenegro y partes de Serbia.",
        "Description[eu]": "Montenegroko trenen operadorea. Montenegro eta Serbiako zatiak hartzen ditu.",
        "Description[fi]": "Montenegron rautatieyhtiö; Montenegron lisäksi toimii osissa Serbiaa.",
        "Description[fr]": "Opérateur ferroviaire au Montenegro. Il couvre le Montenegro et certaines parties de la Serbie.",
        "Description[it]": "Operatore ferroviario in Montenegro. Copre il Montenegro e parte della Serbia.",
        "Description[ka]": "მონტენეგროს მატარებლების ოპერატორი. ფარავს მონტენეგროს და სერბეთის ნაწილს.",
        "Description[ko]": "몬테네그로 철도입니다. 몬테네그로와 세르비아 일부 구간을 운영합니다",
        "Description[nl]": "Laat treinen in Montenegro rijden. Dekt Montenegro en delen van Servië.",
        "Description[pl]": "Operator pociągów w Czarnogórze. Pokrywa Czarnogórę oraz część Serbii.",
        "Description[pt_BR]": "Operador de trens em Montenegro. Cobre Montenegro e partes da Sérvia.",
        "Description[sl]": "Upravljavec vlakov v Črni gori. Pokriva Črno goro in dele Srbije.",
        "Description[tr]": "Karadağ'da tren operatörü. Karadağ'da ve Sırbistan'ın bazı kısımlarında çalışır.",
        "Description[uk]": "Залізничний оператор у Чорногорії. Працює у Чорногорії та частині Сербії.",
        "Description[x-test]": "xxOperator of trains in Montenegro. Covers Montenegro and parts of Serbia.xx",
        "Description[zh_TW]": "蒙特內哥羅的火車營運者。服務蒙特內哥羅，以及塞爾維亞的一部分。",
        "Name": "ZPCG",
        "Name[ca@valencia]": "ZPCG",
        "Name[ca]": "ZPCG",
        "Name[eo]": "ZPCG",
        "Name[es]": "ZPCG",
        "Name[eu]": "ZPCG",
        "Name[fi]": "ZPCG",
        "Name[fr]": "ZPCG",
        "Name[it]": "ZPCG",
        "Name[ka]": "ZPCG",
        "Name[ko]": "ZPCG",
        "Name[nl]": "ZPCG",
        "Name[pl]": "ZPCG",
        "Name[pt_BR]": "ZPCG",
        "Name[sl]": "ZPCG",
        "Name[tr]": "ZPCG",
        "Name[uk]": "ZPCG",
        "Name[x-test]": "xxZPCGxx"
    },
    "attribution": {
        "homepage": "https://www.zpcg.me/",
        "isProprietary": true,
        "name": "ZPCG"
    },
    "coverage": {
        "realtimeCoverage": {
            "area": {
                "coordinates": [
                    [
                        [
                            19.578,
                            45.476
                        ],
                        [
                            22.917,
                            44.692
                        ],
                        [
                            19.4623,
                            41.6195
                        ],
                        [
                            17.666,
                            42.812
                        ]
                    ]
                ],
                "type": "Polygon"
            },
            "region": [
                "ME"
            ]
        }
    },
    "options": {},
    "supportedLanguages": [
        "en",
        "sr"
    ],
    "timezone": "Europe/Podgorica",
    "type": {
        "zpcg": true
    }
}
