Repository: KDE/kpublictransport
Catalog: po/*/kpublictransport.po
Languages: ar, eo, eu, fr, hu, ru, tr, zh_tw

# train seating class
source: First class
ar: الدرجة الأولى
eu: Lehen klasea
fr: Première classe
tr: Birinci sınıf

# train seating class
source: Second class
ar: الدرجة الثانية
eu: Bigarren klasea
fr: Seconde classe
tr: İkinci sınıf

# train seating class
source: First/second class
ar: الدرجة الأولى/الثانية
eu: Lehen/bigarren klasea
fr: Première / deuxième classe
tr: Birinci/ikinci sınıf

# train coach feature
source: Air conditioning
ar: تكييف الهواء
eo: Klimatizo
eu: Aire girotua
fr: Air conditionné
hu: Légkondicionálás
ru: Кондиционирование воздуха
tr: İklimlendirme
zh_tw: 空調

# train coach feature
source: Bistro or restaurant
ar: مقهى أو مطعم
eo: Trinkejeto aŭ restoracio
eu: Bistroa edo jatetxea
fr: Bistrot ou restaurant
hu: Bisztró vagy étterem
ru: Бистро или ресторан
tr: Bistro veya restoran
zh_tw: 酒館或餐廳

# train coach feature
source: Toddler area
ar: منطقة الأطفال الصغار
eo: Infanetejo
eu: Haur txikien gunea
fr: Zone des tout-petits
hu: Kisgyermekes terület
ru: Зона для малышей
tr: Çocuk alanı
zh_tw: 嬰兒區域

# train coach feature
source: Family area
ar: منطقة العائلة
eo: Familiejo
eu: Familia eremua
fr: Zone pour les familles
hu: Családi terület
ru: Семейная зона
tr: Aile alanı
zh_tw: 家庭區域

# train coach feature
source: Wheelchair accessible
ar: وصول الكراسي المتحركة
eo: Rulseĝo alirebla
eu: Gurpil-aulkirako irisgarria
fr: Accessible en fauteuil roulant
hu: Kerekesszékkel megközelíthető
ru: Оборудовано для пользователей кресел-каталок
tr: Tekerlekli sandalyeye uygun
zh_tw: 輪椅無障礙

# train coach feature
source: Quiet area
ar: منطقة هادئة
eo: Trankvilejo
eu: Eremu lasaia
fr: Zone de repos
hu: Csendes terület
ru: Зона отдыха
tr: Sessiz alan
zh_tw: 安靜區域

# train coach feature
source: Business area
ar: منطقة العمل
eo: Komercejo
eu: Negozio eremua
fr: Zone de bureau
hu: Üzleti terület
ru: Деловая зона
tr: Çalışma alanı
zh_tw: 商業區域

# train coach feature
source: Bike storage
ar: تخزين الدراجات
eo: Biciklejo
eu: Bizikleten biltegia
fr: Parc à vélos
hu: Kerékpártároló
ru: Хранение велосипедов
tr: Bisiklet yeri
zh_tw: 腳踏車倉庫

# train coach feature
source: Toilet
ar: مرحاض
eo: Necesejo
eu: Komuna
fr: Toilettes
hu: WC
ru: Туалет
tr: Tuvalet
zh_tw: 廁所

# train coach feature
source: Wheelchair accessible toilet
ar: مرحاض لوصول الكراسي المتحركة
eo: Rulseĝe alirebla necesejo
eu: Gurpil-aulkirako komun irisgarria
fr: Toilettes accessibles aux fauteuils roulants
hu: Kerekesszékkel megközelíthető WC
ru: Оборудованный для пользователей кресел-каталок туалет
tr: Tekerlekli sandalyeye uygun tuvalet
zh_tw: 輪椅無障礙廁所

# train coach feature
source: Information point
ar: نقطة معلومات
eo: Informejo
eu: Informazio-puntua
fr: Point d'informations
hu: Információs pont
ru: Информационная стойка
tr: Bilgi noktası
zh_tw: 資訊點

# train coach feature
source: Wi-Fi
ar: شبكة لاسلكية

# train coach feature
source: Power sockets
ar: مقابس الطاقة
eo: Potencingoj
eu: Elektrizitate harguneak
fr: Prises de courant
hu: Elektromos aljzatok
ru: Розетки
tr: Priz
zh_tw: 插座

# mode of individual transport
source: Bike
ar: دراجة
eu: Bizikleta
fr: Vélo
ru: Велосипед
tr: Bisiklet
zh_tw: 腳踏車

# mode of individual transport
source: Car
ar: سيارة
eu: Autoa
fr: Voiture
ru: Автомобиль
tr: Araba
zh_tw: 汽車

# mode of individual transport
source: Walk
ar: مشي
eu: Oinez
fr: Marche
ru: Пешком
tr: Yürüme
zh_tw: 步行

source: Wait
ar: انتظر
eu: Itxoin
fr: Attente
ru: Ожидание
tr: Bekleme
zh_tw: 等待

# rental vehicle type
source: Rented bike
ar: دراجة مستأجرة
eu: Alokairuko bizikleta
fr: Vélo loué
ru: Арендный велосипед
tr: Kiralık bisiklet
zh_tw: 租借腳踏車

# rental vehicle type
source: Rented moped
ar: دراجة نارية مستأجرة
eu: Alokairuko ziklomotorra
fr: Vélomoteur loué
ru: Арендный мопед
tr: Kiralık moped
zh_tw: 租借機車

# rental vehicle type
source: Rented kick scooter
ar: سكوتر مستأجر
eu: Alokairuko patinete elektrikoa
fr: Patinette louée
ru: Арендный самокат
tr: Kiralık ayaklı kaykay
zh_tw: 租借滑班車

# rental vehicle type
source: Rented car
ar: سيارة مستأجرة
eu: Alokairuko autoa
fr: Voiture de location
ru: Арендный автомобиль
tr: Kiralık araba
zh_tw: 租借汽車

# train coach type
source: Sleeping car
ar: عربة نوم
eu: Lotarako bagoia
fr: Wagon-lit
tr: Yataklı vagon

# train coach type
source: Couchette car
ar: عربة أسِرّة
eu: Litera-bagoia
fr: Wagon-couchettes
tr: Kuşetli vagon

# train coach type
source: Restaurant car
ar: عربة مطعم
eu: Jatetxe-bagoia
fr: Voiture restaurant
tr: Yemekli vagon

# train coach type
source: Car transport car
ar: عربة نقل سيارات
eu: Auto garraiorako bagoia
fr: Plate-forme de transport de voitures
tr: Oto taşıma vagonu

source: Check for Updates
ar: تحقّق من التحديثات
eu: Egiaztatu eguneratzeak
fr: Rechercher des mises à jour
tr: Güncellemeleri Denetle

source: Already up to date.
ar: أنت محدَّث بالفعل.
eu: Dagoeneko eguneratuta.
fr: Déjà à jour.
tr: Halihazırda güncel.

source: Update successful.
ar: التحديث ناجح.
eu: Eguneratze arrakastatsua.
fr: La mise à jour a réussi.
tr: Güncelleme başarılı oldu.

source: Update failed.
ar: التحديث فاشل.
eu: Eguneratzeak huts egin du.
fr: La mise à jour a échoué.
tr: Güncelleme başarısız oldu.

source: Public Transport Information Sources
ar: مصادر معلومات النقل العام
eu: Garraio publikoko informazio iturriak
fr: Sources d'informations sur les transports publics
tr: Toplu Taşıma Bilgi Kaynakları

source: Global
ar: عالمي
eu: Globala

source: 🇪🇺 European Union
ar: 🇪🇺 الاتحاد الأوروبي
eu: 🇪🇺 Europar Batasuna
fr: 🇪🇺 Union européenne
tr: 🇪🇺 Avrupa Birliği

source: European Union
ar: الاتحاد الأوروبي
eu: Europar Batasuna
fr: Union européenne
tr: Avrupa Birliği

# a train/bus journey canceled by its operator
source: Canceled
ar: مُلغى
eu: Ezeztatuta
fr: Annulé
tr: İptal edilmiş

# duration of the delay
source: Delayed %1
ar: تأخير %1
eu: %1(e)ko atzerapena
fr: Retardé de %1
tr: %1 kadar gecikecek

# earlier arrival/departure
source: %1 earlier
ar: قبل %1
eu: %1 goizago
fr: %1 plus tôt
tr: %1 kadar daha erken

# @info
source: On time
ar: في الموعد
eu: Garaiz
fr: À l'heure
tr: Zamanında

source: Availability unknown
ar: التوفّر مجهول
eu: Erabilgarritasun ezezaguna
fr: Disponibilité inconnue
tr: Kullanılabilirliği bilinmiyor

source: Not available
ar: غير متوفّر
eu: Ez erabilgarri
fr: Indisponible
tr: Kullanılabilir değil

source: Currently not available
ar: غير متوفّر حاليًا
eu: Une honetan ez dago erabilgarri
fr: Actuellement indisponible
tr: Şu anda kullanılamıyor

# bike/wheelchair spaces on a train/bus
source: One space
ar: مساحة واحدة
eu: Toki bat
fr: Un emplacement
tr: 1 yer

source: %1 (availability unknown)
ar: %1 (التوفّر مجهول)
eu: %1 (erabilgarritasun ezezaguna)
fr: %1 (Disponibilité inconnue)
tr: %1 (kullanılabilirliği bilinmiyor)

source: %1 (not available)
ar: %1 (غير متوفّر)
eo: %1 (ne disponebla)
eu: %1 (ez erabilgarri)
fr: %1 (Indisponible)
hu: %1 (nem érhető el)
ru: %1 (недоступно)
tr: %1 (kullanılamıyor)
zh_tw: %1（無法使用）

# bike/wheelchair spaces on a train/bus
source: %2 (one space)
ar: %2 (مساحة واحدة)
eu: %2 (toki bat)
fr: %2 (Un emplacement)
tr: %2 (1 yer)

# vehicle occupancy
source: Low occupancy
ar: إشغال منخفض
eo: Malalta okupado
eu: Okupazio txikia
fr: Faible taux d'occupation
hu: Alacsony kihasználtság
ru: Низкая занятность
tr: Düşük doluluk
zh_tw: 低承載

# vehicle occupancy
source: Medium occupancy
ar: إشغال متوسّط
eo: Meza okupado
eu: Okupazio ertaina
fr: Taux d'occupation moyen
hu: Közepes kihasználtság
ru: Средняя занятость
tr: Orta doluluk
zh_tw: 中承載

# vehicle occupancy
source: High occupancy
ar: إشغال مرتفع
eo: Alta okupado
eu: Okupazio handia
fr: Taux d'occupation élevé
hu: Magas kihasználtság
ru: Высокая занятость
tr: Yüksek doluluk
zh_tw: 高承載

# vehicle occupancy
source: Full
ar: ممتلئ
eo: Plena
eu: Beteta
fr: Plein
hu: Megtelt
ru: Полная занятость
tr: Dolu
zh_tw: 滿座

source: Select country
ar: اختر البلد
eu: Hautatu herrialdea
fr: Sélectionner un pays
tr: Ülke seç

source: Current Location
ar: الموقع الحالي
eu: Uneko kokalekua
fr: Emplacement courant
tr: Geçerli konum

source: Determining Location…
ar: يحدّد الموقع…
eu: Kokapena zehazten…
fr: Détermination de l'emplacement en cours…
tr: Konum algılanıyor…

source: Waiting for more accurate location…
ar: ينتظر موقعًا أكثر دقّة…
eu: Kokapen zehatzago baten zain…
fr: En attente d'une localisation plus précise…
tr: Daha kesin bir konum için bekleniyor…

source: Looking up address…
ar: يبحث عن العنوان…
eu: Helbidea bilatzen…
fr: Recherche de l'adresse en cours...
tr: Adres aranıyor…

source: Failed to determine accurate enough location.
ar: فشلت في تحديد موقع دقيق بما فيه الكفاية.
eu: Ezin izan da kokapen zehatza zehaztu.
fr: Impossible de déterminer un emplacement suffisamment précis.
tr: Yeterince kesin bir konum belirlenemedi.

source: Failed to determine location.
ar: فشلت في تحديد الموقع.
eu: Kokapena zehaztea huts egin du.
fr: Impossible de déterminer l'emplacement.
tr: Konum belirlenemedi.

source: Information
ar: معلومات
eu: Informazioa
fr: Informations
tr: Bilgi

source: Occupancy
ar: إشغال
eu: Okupazioa
fr: Fréquentation
tr: Doluluk

source: Amenities
ar: وسائل الراحة
eu: Zerbitzuak
fr: Équipements
tr: Hizmetler

# operator/provider of a rail/bus service
source: Operator
ar: المشغّل
eu: Operadorea
fr: Compagnie
tr: Firma

# @title:dialog
source: Clear History
ar: امسح السجل
eu: Garbitu historia
fr: Effacer l'historique
tr: Geçmişi Temizle

# @info
source: Do you really want to remove all previously searched locations?
ar: هل تريد إزالة جميع المواقع التي بحث عنها سابقًا حقًا؟
eu: Benetan kendu nahi dituzu aurrez bilatutako kokaleku guztiak?
fr: Voulez-vous vraiment supprimer tous les emplacements précédemment recherchés ?
tr: Daha önceden aranmış tüm konumları kaldırmayı gerçekten istiyor musunuz?

# @action:button
source: Remove
ar: أزل
eu: Kendu
fr: Supprimer
tr: Kaldır

# @action
source: Clear history
ar: امسح السجل
eu: Garbitu historia
fr: Effacer l'historique
tr: Geçmişi Temizle

# @action
source: Sort by name
ar: رتب حسب الاسم
eu: Sailkatu izenaren arabera
fr: Trier par nom
tr: Ada Göre Sırala

# @action
source: Most recently used
ar: التي استخدمت مؤخرًا
eu: Duela gutxien erabilia
fr: Le ou les plus fréquemment utilisés
tr: Son Kullanılanlar

# @action
source: Most often used
ar: التي استخدمت كثيرًا
eu: Gehien erabiltzen dena
fr: Le plus fréquemment utilisé
tr: Sık Kullanılanlar

# @action:button
source: Remove history entry
ar: أزل إدخال السجل
eu: Kendu historiako sarrera
fr: Supprimer l'entrée d'historique
tr: Geçmiş girdisini kaldır

# @info:placeholder
source: No locations found
ar: لا يوجد مواقع
eu: Ez du kokalekurik aurkitu
fr: Aucun emplacement trouvé
tr: Bulunan konum yok

# train coach feature
source: Sleeper Compartment
eu: Ohe konpartimendua
fr: Compartiment couchette
tr: Yataklı Kompartman

source: %2 (one space)
eo: %2 (unu liberloko)
hu: %2 (egy hely)
ru: %2 (%1 место)
zh_tw: %2（%1 個位子）
